In [1]:
#import library
import numpy as np
import pandas as pd

In [31]:
df=pd.DataFrame({'name': ['Raven Bierman', 'Valter Havers', 'Marko Mendell', 'Takahiro Momota','Yahiko Tilemans', 'Dina Rebaine'],
    'gender': ['Female','Male','Male','Male','Male','Female'],
    'hire date': ['2016-12-04','2018-04-13','2018-07-04','2016-11-18','2017-05-26','2015-03-20'],
    'gross salary':[7000000,7000000,15000000,12000000,20000000,15000000]},
    index=[100111,100112,200210,200211,200312,300207])
df

                   name  gender   hire date  gross salary
100111    Raven Bierman  Female  2016-12-04       7000000
100112    Valter Havers    Male  2018-04-13       7000000
200210    Marko Mendell    Male  2018-07-04      15000000
200211  Takahiro Momota    Male  2016-11-18      12000000
200312  Yahiko Tilemans    Male  2017-05-26      20000000
300207     Dina Rebaine  Female  2015-03-20      15000000

Adding data to dataframe

In [6]:
df.loc[300208]=['Andi','Male','2021-11-15',10000000] #untuk menambah baris baru
# indexing dengan .loc dan label kolom baru, lalu masukkan data sesuai jumlah kolom
df

                   name  gender   hire date  gross salary
100111    Raven Bierman  Female  2016-12-04       7000000
100112    Valter Havers    Male  2018-04-13       7000000
200210    Marko Mendell    Male  2018-07-04      15000000
200211  Takahiro Momota    Male  2016-11-18      12000000
200312  Yahiko Tilemans    Male  2017-05-26      20000000
300207     Dina Rebaine  Female  2015-03-20      15000000
300208             Andi    Male  2021-11-15      10000000

In [7]:
df['net salary']=df['gross salary']*0.85 #net salary adalah gross salary setelah dipotong pajak 15%
# untuk menambah kolom baru, 
# mirip seperti menambah baris baru, cukup indexing dengan nama kolom baru, lalu masukkan data yang diinginkan
df

                   name  gender   hire date  gross salary  net salary
100111    Raven Bierman  Female  2016-12-04       7000000   5950000.0
100112    Valter Havers    Male  2018-04-13       7000000   5950000.0
200210    Marko Mendell    Male  2018-07-04      15000000  12750000.0
200211  Takahiro Momota    Male  2016-11-18      12000000  10200000.0
200312  Yahiko Tilemans    Male  2017-05-26      20000000  17000000.0
300207     Dina Rebaine  Female  2015-03-20      15000000  12750000.0
300208             Andi    Male  2021-11-15      10000000   8500000.0

In [8]:
# dengan cara indexing, baris/kolom baru yang dibuat selalu berada di posisi terakhir
# kalau kita ingin menambahkan data di posisi kolom tertentu, gunakan insert
df.insert(2,'new',[1,2,3,4,5,6,7]) #menambahkan kolom new di posisi index 2 pada df
df

                   name  gender  new   hire date  gross salary  net salary
100111    Raven Bierman  Female    1  2016-12-04       7000000   5950000.0
100112    Valter Havers    Male    2  2018-04-13       7000000   5950000.0
200210    Marko Mendell    Male    3  2018-07-04      15000000  12750000.0
200211  Takahiro Momota    Male    4  2016-11-18      12000000  10200000.0
200312  Yahiko Tilemans    Male    5  2017-05-26      20000000  17000000.0
300207     Dina Rebaine  Female    6  2015-03-20      15000000  12750000.0
300208             Andi    Male    7  2021-11-15      10000000   8500000.0

In [9]:
# delete data tertentu, pakai .drop()
df.drop('new',axis=1) # axis 1= kolom, jadi kita mau drop kolom bernama new

                   name  gender   hire date  gross salary  net salary
100111    Raven Bierman  Female  2016-12-04       7000000   5950000.0
100112    Valter Havers    Male  2018-04-13       7000000   5950000.0
200210    Marko Mendell    Male  2018-07-04      15000000  12750000.0
200211  Takahiro Momota    Male  2016-11-18      12000000  10200000.0
200312  Yahiko Tilemans    Male  2017-05-26      20000000  17000000.0
300207     Dina Rebaine  Female  2015-03-20      15000000  12750000.0
300208             Andi    Male  2021-11-15      10000000   8500000.0

In [10]:
df # new tidak hilang permanen, jika tidak disimpan atau menggunakan inplace

                   name  gender  new   hire date  gross salary  net salary
100111    Raven Bierman  Female    1  2016-12-04       7000000   5950000.0
100112    Valter Havers    Male    2  2018-04-13       7000000   5950000.0
200210    Marko Mendell    Male    3  2018-07-04      15000000  12750000.0
200211  Takahiro Momota    Male    4  2016-11-18      12000000  10200000.0
200312  Yahiko Tilemans    Male    5  2017-05-26      20000000  17000000.0
300207     Dina Rebaine  Female    6  2015-03-20      15000000  12750000.0
300208             Andi    Male    7  2021-11-15      10000000   8500000.0

In [11]:
df.drop('new', axis=1, inplace=True) # dengan inplace=True, perubahan menjadi permanen
# kalau pakai inplace tidak ada output, tanda data berubah

In [12]:
df # kolom new sudah tidak ada

                   name  gender   hire date  gross salary  net salary
100111    Raven Bierman  Female  2016-12-04       7000000   5950000.0
100112    Valter Havers    Male  2018-04-13       7000000   5950000.0
200210    Marko Mendell    Male  2018-07-04      15000000  12750000.0
200211  Takahiro Momota    Male  2016-11-18      12000000  10200000.0
200312  Yahiko Tilemans    Male  2017-05-26      20000000  17000000.0
300207     Dina Rebaine  Female  2015-03-20      15000000  12750000.0
300208             Andi    Male  2021-11-15      10000000   8500000.0

In [14]:
df=df.drop(300208,axis=0) #axis=0 delete baris #kalau diassign ke df, tidak ada output
# selain menggunakan inplace, kita bisa menyimpan output drop ke dalam df untuk membuat perubahan menjadi permanen

In [15]:
df #data andi sudah hilang

                   name  gender   hire date  gross salary  net salary
100111    Raven Bierman  Female  2016-12-04       7000000   5950000.0
100112    Valter Havers    Male  2018-04-13       7000000   5950000.0
200210    Marko Mendell    Male  2018-07-04      15000000  12750000.0
200211  Takahiro Momota    Male  2016-11-18      12000000  10200000.0
200312  Yahiko Tilemans    Male  2017-05-26      20000000  17000000.0
300207     Dina Rebaine  Female  2015-03-20      15000000  12750000.0

serial indexing dan assignment data baru

In [16]:

df['name']=['Raven Bierman', 'Valter Havers', 'Marko Mendell', 'Takahiro Momoka','Yahiko Tilemans', 'Dina Rebaine']
df #assignment dengan 1 index tidak ada masalah dengan atau tanpa .loc

                   name  gender   hire date  gross salary  net salary
100111    Raven Bierman  Female  2016-12-04       7000000   5950000.0
100112    Valter Havers    Male  2018-04-13       7000000   5950000.0
200210    Marko Mendell    Male  2018-07-04      15000000  12750000.0
200211  Takahiro Momoka    Male  2016-11-18      12000000  10200000.0
200312  Yahiko Tilemans    Male  2017-05-26      20000000  17000000.0
300207     Dina Rebaine  Female  2015-03-20      15000000  12750000.0

In [19]:
df['gender'][200211]='Female' #hasil assignmet serial indexing tidak konsisten, kadang berhasil kadang tidak
# keterangan lebih lanjut bisa baca di dokumentasi di bawah

<ipython-input-19-4989f9131e4f>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['gender'][200211]='Female'

In [20]:
df #ini berhasil

                   name  gender   hire date  gross salary  net salary
100111    Raven Bierman  Female  2016-12-04       7000000   5950000.0
100112    Valter Havers    Male  2018-04-13       7000000   5950000.0
200210    Marko Mendell    Male  2018-07-04      15000000  12750000.0
200211  Takahiro Momoka  Female  2016-11-18      12000000  10200000.0
200312  Yahiko Tilemans    Male  2017-05-26      20000000  17000000.0
300207     Dina Rebaine  Female  2015-03-20      15000000  12750000.0

In [23]:
df.loc[100111,'gender']='Male' #untuk assigment nilai baru, tidak disarankan menggunakan serial indexing
# penggunakan .loc seperti diatas lebih disarankan

In [26]:
df[df['gender']=='Male']['gender']=1 # keluar warning, karena mau melakukan assignment di serial indexing

<ipython-input-26-115fb94c7b35>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[df['gender']=='Male']['gender']=1

In [27]:
df #hasil tidak berubah

                   name  gender   hire date  gross salary  net salary
100111    Raven Bierman    Male  2016-12-04       7000000   5950000.0
100112    Valter Havers    Male  2018-04-13       7000000   5950000.0
200210    Marko Mendell    Male  2018-07-04      15000000  12750000.0
200211  Takahiro Momoka  Female  2016-11-18      12000000  10200000.0
200312  Yahiko Tilemans    Male  2017-05-26      20000000  17000000.0
300207     Dina Rebaine  Female  2015-03-20      15000000  12750000.0

In [28]:
df.loc[df['gender']=='Male','gender']=1

In [29]:
df #yang ini berubah

                   name  gender   hire date  gross salary  net salary
100111    Raven Bierman       1  2016-12-04       7000000   5950000.0
100112    Valter Havers       1  2018-04-13       7000000   5950000.0
200210    Marko Mendell       1  2018-07-04      15000000  12750000.0
200211  Takahiro Momoka  Female  2016-11-18      12000000  10200000.0
200312  Yahiko Tilemans       1  2017-05-26      20000000  17000000.0
300207     Dina Rebaine  Female  2015-03-20      15000000  12750000.0

More about Index

In [32]:
df

                   name  gender   hire date  gross salary
100111    Raven Bierman  Female  2016-12-04       7000000
100112    Valter Havers    Male  2018-04-13       7000000
200210    Marko Mendell    Male  2018-07-04      15000000
200211  Takahiro Momota    Male  2016-11-18      12000000
200312  Yahiko Tilemans    Male  2017-05-26      20000000
300207     Dina Rebaine  Female  2015-03-20      15000000

In [33]:
df.reset_index() #mengembalikan index kembali ke default, dan index sebelumnya menjadi kolom baru

    index             name  gender   hire date  gross salary
0  100111    Raven Bierman  Female  2016-12-04       7000000
1  100112    Valter Havers    Male  2018-04-13       7000000
2  200210    Marko Mendell    Male  2018-07-04      15000000
3  200211  Takahiro Momota    Male  2016-11-18      12000000
4  200312  Yahiko Tilemans    Male  2017-05-26      20000000
5  300207     Dina Rebaine  Female  2015-03-20      15000000

In [34]:
df.reset_index(drop=True) #jika kita tidak ingin index lama menjadi kolom baru, bisa pakai drop=True

              name  gender   hire date  gross salary
0    Raven Bierman  Female  2016-12-04       7000000
1    Valter Havers    Male  2018-04-13       7000000
2    Marko Mendell    Male  2018-07-04      15000000
3  Takahiro Momota    Male  2016-11-18      12000000
4  Yahiko Tilemans    Male  2017-05-26      20000000
5     Dina Rebaine  Female  2015-03-20      15000000

In [35]:
df=df.reset_index() #jangan lupa simpan/ lakukan inplace agar perubahan menjadi permanen
df

    index             name  gender   hire date  gross salary
0  100111    Raven Bierman  Female  2016-12-04       7000000
1  100112    Valter Havers    Male  2018-04-13       7000000
2  200210    Marko Mendell    Male  2018-07-04      15000000
3  200211  Takahiro Momota    Male  2016-11-18      12000000
4  200312  Yahiko Tilemans    Male  2017-05-26      20000000
5  300207     Dina Rebaine  Female  2015-03-20      15000000

In [36]:
df.rename(columns={'index':'ID'}) #mengganti nama kolom index menjadi ID

       ID             name  gender   hire date  gross salary
0  100111    Raven Bierman  Female  2016-12-04       7000000
1  100112    Valter Havers    Male  2018-04-13       7000000
2  200210    Marko Mendell    Male  2018-07-04      15000000
3  200211  Takahiro Momota    Male  2016-11-18      12000000
4  200312  Yahiko Tilemans    Male  2017-05-26      20000000
5  300207     Dina Rebaine  Female  2015-03-20      15000000

In [37]:
df.columns # nama-nama kolom di df

Index(['index', 'name', 'gender', 'hire date', 'gross salary'], dtype='object')

In [38]:
df.index # label index

RangeIndex(start=0, stop=6, step=1)

In [41]:
df.index=[100111,100112,200210,200211,200312,300207] # bisa dipakai untuk assign 1 set label index/kolom ( untuk .columns)

In [42]:
df

         index             name  gender   hire date  gross salary
100111  100111    Raven Bierman  Female  2016-12-04       7000000
100112  100112    Valter Havers    Male  2018-04-13       7000000
200210  200210    Marko Mendell    Male  2018-07-04      15000000
200211  200211  Takahiro Momota    Male  2016-11-18      12000000
200312  200312  Yahiko Tilemans    Male  2017-05-26      20000000
300207  300207     Dina Rebaine  Female  2015-03-20      15000000

In [43]:
df=df.reset_index(drop=True)
df

    index             name  gender   hire date  gross salary
0  100111    Raven Bierman  Female  2016-12-04       7000000
1  100112    Valter Havers    Male  2018-04-13       7000000
2  200210    Marko Mendell    Male  2018-07-04      15000000
3  200211  Takahiro Momota    Male  2016-11-18      12000000
4  200312  Yahiko Tilemans    Male  2017-05-26      20000000
5  300207     Dina Rebaine  Female  2015-03-20      15000000

In [44]:
df.rename(columns={'index':'ID'}, inplace=True)
df #jangan lupa disimpan

       ID             name  gender   hire date  gross salary
0  100111    Raven Bierman  Female  2016-12-04       7000000
1  100112    Valter Havers    Male  2018-04-13       7000000
2  200210    Marko Mendell    Male  2018-07-04      15000000
3  200211  Takahiro Momota    Male  2016-11-18      12000000
4  200312  Yahiko Tilemans    Male  2017-05-26      20000000
5  300207     Dina Rebaine  Female  2015-03-20      15000000

In [46]:
# membuat kolom tertentu menjadi label index
df.set_index('ID',inplace=True)

In [47]:
df

                   name  gender   hire date  gross salary
ID
100111    Raven Bierman  Female  2016-12-04       7000000
100112    Valter Havers    Male  2018-04-13       7000000
200210    Marko Mendell    Male  2018-07-04      15000000
200211  Takahiro Momota    Male  2016-11-18      12000000
200312  Yahiko Tilemans    Male  2017-05-26      20000000
300207     Dina Rebaine  Female  2015-03-20      15000000

Sorting

In [49]:
# .sort_values() untuk mengurutkan data berdasarkan kolom tertentu

df.sort_values('name') #mengurutkan data karyawan berdasarkan kolom nama, secara default kecil ke besar

                   name  gender   hire date  gross salary
ID
300207     Dina Rebaine  Female  2015-03-20      15000000
200210    Marko Mendell    Male  2018-07-04      15000000
100111    Raven Bierman  Female  2016-12-04       7000000
200211  Takahiro Momota    Male  2016-11-18      12000000
100112    Valter Havers    Male  2018-04-13       7000000
200312  Yahiko Tilemans    Male  2017-05-26      20000000

In [50]:
df.sort_values(['gender','name']) # mengurutkan berdasarkan gender lalu name

                   name  gender   hire date  gross salary
ID
300207     Dina Rebaine  Female  2015-03-20      15000000
100111    Raven Bierman  Female  2016-12-04       7000000
200210    Marko Mendell    Male  2018-07-04      15000000
200211  Takahiro Momota    Male  2016-11-18      12000000
100112    Valter Havers    Male  2018-04-13       7000000
200312  Yahiko Tilemans    Male  2017-05-26      20000000

In [57]:
df.sort_values('name',ascending=False) # mengurutkan data dari besar ke kecil ketika ascending=False

                   name  gender   hire date  gross salary
ID
200312  Yahiko Tilemans    Male  2017-05-26      20000000
100112    Valter Havers    Male  2018-04-13       7000000
200211  Takahiro Momota    Male  2016-11-18      12000000
100111    Raven Bierman  Female  2016-12-04       7000000
200210    Marko Mendell    Male  2018-07-04      15000000
300207     Dina Rebaine  Female  2015-03-20      15000000

In [61]:
df.sort_values(['gender','gross salary'],ascending=[False,True]) # diurutkan berdasarkan gender dulu (male dulu baru female (besar ke kecil))
# baru gaji, kecil ke besar

                   name  gender   hire date  gross salary
ID
100112    Valter Havers    Male  2018-04-13       7000000
200211  Takahiro Momota    Male  2016-11-18      12000000
200210    Marko Mendell    Male  2018-07-04      15000000
200312  Yahiko Tilemans    Male  2017-05-26      20000000
100111    Raven Bierman  Female  2016-12-04       7000000
300207     Dina Rebaine  Female  2015-03-20      15000000

Multi Index

In [62]:
# creating multi index
# index level

outside='Jakarta Jakarta Jakarta Surabaya Surabaya Surabaya'.split() # index level 1/atas
inside=[1,2,3,1,2,3] #index level 2/bawah

print(outside)
inside

['Jakarta', 'Jakarta', 'Jakarta', 'Surabaya', 'Surabaya', 'Surabaya']

[1, 2, 3, 1, 2, 3]

In [63]:
hier_index=list(zip(outside,inside)) # dipasangkan dengan zip
hier_index

[('Jakarta', 1),
 ('Jakarta', 2),
 ('Jakarta', 3),
 ('Surabaya', 1),
 ('Surabaya', 2),
 ('Surabaya', 3)]

In [64]:
hier_index= pd.MultiIndex.from_tuples(hier_index) # ubah data tipe menjadi multi index
# from tuples karena hasil zip berupa tuple
hier_index

MultiIndex([( 'Jakarta', 1),
            ( 'Jakarta', 2),
            ( 'Jakarta', 3),
            ('Surabaya', 1),
            ('Surabaya', 2),
            ('Surabaya', 3)],
           )

In [66]:
df_multi=pd.DataFrame(np.random.randint(1,100,12).reshape(6,2), index=hier_index,columns=['Smartphone','PC']) 
# tabel penjualan smartphone vs pc di toko-toko di jakarta dan surabaya
df_multi

            Smartphone  PC
Jakarta  1          34  23
         2          37  83
         3          42  53
Surabaya 1          10  55
         2          35   8
         3          33  55

In [67]:
df_multi.loc['Jakarta']
# MultiIndex memudahkan kita mencari data dalam kelompok tertentu
# menampilkan data penjualan di seluruh toko di Jakarta

   Smartphone  PC
1          34  23
2          37  83
3          42  53

In [68]:
df_multi.loc['Jakarta'].loc[2] #menampilkan data penjualan toko 2 di jakarta

Smartphone    37
PC            83
Name: 2, dtype: int32

In [69]:
df_multi.xs(['Jakarta',2]) # function xs dipakai untuk melakukan indexing pada multi index
#bisa dipakai menggantikan double loc
# menampilkan data penjualan toko 2 di jakarta

Smartphone    37
PC            83
Name: (Jakarta, 2), dtype: int32

In [71]:
df_multi.index.names # mengecek nama index di df_multi
# belum ada nama

FrozenList([None, None])

In [72]:
df_multi.index.names=['Kota','Lokasi'] # assign nama kota untuk index luar dan lokasi untuk index dalam
df_multi

                 Smartphone  PC
Kota     Lokasi
Jakarta  1               34  23
         2               37  83
         3               42  53
Surabaya 1               10  55
         2               35   8
         3               33  55

In [73]:
df_multi.xs(1,level='Lokasi') # mengakses data toko lokasi 1 baik di jakarta maupun surabaya
# .xs bisa dipakai untuk mengakses data multi index menggunakan nama index

          Smartphone  PC
Kota
Jakarta           34  23
Surabaya          10  55

**latihan**

coba buat dataframe berikut, simpan di variabel df_multi2

In [78]:
outside='Jawa Jawa Jawa Sumatera Sumatera Sumatera Sulawesi Sulawesi Sulawesi'.split()
inside=['Jakarta','Bandung','Surabaya','Medan','Padang','Palembang','Manado','Palu','Makassar']
hier_index2=list(zip(outside,inside))
hier_index2=pd.MultiIndex.from_tuples(hier_index2)
hier_index2

MultiIndex([(    'Jawa',   'Jakarta'),
            (    'Jawa',   'Bandung'),
            (    'Jawa',  'Surabaya'),
            ('Sumatera',     'Medan'),
            ('Sumatera',    'Padang'),
            ('Sumatera', 'Palembang'),
            ('Sulawesi',    'Manado'),
            ('Sulawesi',      'Palu'),
            ('Sulawesi',  'Makassar')],
           )

In [81]:
df_multi2=pd.DataFrame(
    {
        'Manager':['Andi Susetyo','Budi Budiawan','Cecep Maricep','Diana Wijaya','Eddy Susanto','Franky Sujaya','Galih Diantara','Hans Leman','Ingrid Mahesa'],
        'Total Produksi':[15,12,12,13,16,18,20,11,14],
        'Jumlah Karyawan':[20,15,12,14,18,14,25,12,13]
    },
    index=hier_index2
)
df_multi2

                           Manager  Total Produksi  Jumlah Karyawan
Jawa     Jakarta      Andi Susetyo              15               20
         Bandung     Budi Budiawan              12               15
         Surabaya    Cecep Maricep              12               12
Sumatera Medan        Diana Wijaya              13               14
         Padang       Eddy Susanto              16               18
         Palembang   Franky Sujaya              18               14
Sulawesi Manado     Galih Diantara              20               25
         Palu           Hans Leman              11               12
         Makassar    Ingrid Mahesa              14               13

In [80]:
pd.DataFrame(np.arange(27).reshape(3,9),columns=hier_index2) # multi index juga bisa di kolom

     Jawa                  Sumatera                  Sulawesi
  Jakarta Bandung Surabaya    Medan Padang Palembang   Manado Palu Makassar
0       0       1        2        3      4         5        6    7        8
1       9      10       11       12     13        14       15   16       17
2      18      19       20       21     22        23       24   25       26

In [82]:
df_multi2

                           Manager  Total Produksi  Jumlah Karyawan
Jawa     Jakarta      Andi Susetyo              15               20
         Bandung     Budi Budiawan              12               15
         Surabaya    Cecep Maricep              12               12
Sumatera Medan        Diana Wijaya              13               14
         Padang       Eddy Susanto              16               18
         Palembang   Franky Sujaya              18               14
Sulawesi Manado     Galih Diantara              20               25
         Palu           Hans Leman              11               12
         Makassar    Ingrid Mahesa              14               13

In [86]:
# data dari kota palembang
df_multi2.loc['Sumatera'].loc['Palembang']

Manager            Franky Sujaya
Total Produksi                18
Jumlah Karyawan               14
Name: Palembang, dtype: object

In [87]:
df_multi2.xs(['Sumatera','Palembang'])

Manager            Franky Sujaya
Total Produksi                18
Jumlah Karyawan               14
Name: (Sumatera, Palembang), dtype: object

In [89]:
df_multi2['penjualan']=[1000,200,3000,12000,8000,5000,7000,2500,9000]

In [90]:
df_multi2

                           Manager  Total Produksi  Jumlah Karyawan  penjualan
Jawa     Jakarta      Andi Susetyo              15               20       1000
         Bandung     Budi Budiawan              12               15        200
         Surabaya    Cecep Maricep              12               12       3000
Sumatera Medan        Diana Wijaya              13               14      12000
         Padang       Eddy Susanto              16               18       8000
         Palembang   Franky Sujaya              18               14       5000
Sulawesi Manado     Galih Diantara              20               25       7000
         Palu           Hans Leman              11               12       2500
         Makassar    Ingrid Mahesa              14               13       9000

In [91]:
df_multi2.index.names=['Region','Kota']
df_multi2

                           Manager  Total Produksi  Jumlah Karyawan  penjualan
Region   Kota
Jawa     Jakarta      Andi Susetyo              15               20       1000
         Bandung     Budi Budiawan              12               15        200
         Surabaya    Cecep Maricep              12               12       3000
Sumatera Medan        Diana Wijaya              13               14      12000
         Padang       Eddy Susanto              16               18       8000
         Palembang   Franky Sujaya              18               14       5000
Sulawesi Manado     Galih Diantara              20               25       7000
         Palu           Hans Leman              11               12       2500
         Makassar    Ingrid Mahesa              14               13       9000

In [93]:
# region dan kota menajdi kolom
df_multi2=df_multi2.reset_index()

In [95]:
df_multi2

,Region,Kota,Manager,Total Produksi,Jumlah Karyawan,penjualan
0,Jawa,Jakarta,Andi Susetyo,15,20,1000
1,Jawa,Bandung,Budi Budiawan,12,15,200
2,Jawa,Surabaya,Cecep Maricep,12,12,3000
3,Sumatera,Medan,Diana Wijaya,13,14,12000
4,Sumatera,Padang,Eddy Susanto,16,18,8000
5,Sumatera,Palembang,Franky Sujaya,18,14,5000
6,Sulawesi,Manado,Galih Diantara,20,25,7000
7,Sulawesi,Palu,Hans Leman,11,12,2500
8,Sulawesi,Makassar,Ingrid Mahesa,14,13,9000

In [97]:
df_multi2.set_index('Region',inplace=True)
df_multi2

,Kota,Manager,Total Produksi,Jumlah Karyawan,penjualan
Region,,,,,
Jawa,Jakarta,Andi Susetyo,15,20,1000
Jawa,Bandung,Budi Budiawan,12,15,200
Jawa,Surabaya,Cecep Maricep,12,12,3000
Sumatera,Medan,Diana Wijaya,13,14,12000
Sumatera,Padang,Eddy Susanto,16,18,8000
Sumatera,Palembang,Franky Sujaya,18,14,5000
Sulawesi,Manado,Galih Diantara,20,25,7000
Sulawesi,Palu,Hans Leman,11,12,2500
Sulawesi,Makassar,Ingrid Mahesa,14,13,9000

In [100]:
# ganti nama kolom manager menjadi mandor
df_multi2.rename(columns={'Manager':'Mandor'},inplace=True)
df_multi2

,Kota,Mandor,Total Produksi,Jumlah Karyawan,penjualan
Region,,,,,
Jawa,Jakarta,Andi Susetyo,15,20,1000
Jawa,Bandung,Budi Budiawan,12,15,200
Jawa,Surabaya,Cecep Maricep,12,12,3000
Sumatera,Medan,Diana Wijaya,13,14,12000
Sumatera,Padang,Eddy Susanto,16,18,8000
Sumatera,Palembang,Franky Sujaya,18,14,5000
Sulawesi,Manado,Galih Diantara,20,25,7000
Sulawesi,Palu,Hans Leman,11,12,2500
Sulawesi,Makassar,Ingrid Mahesa,14,13,9000

Pandas Functionality

In [101]:
df=df_multi2.reset_index()
df

,Region,Kota,Mandor,Total Produksi,Jumlah Karyawan,penjualan
0,Jawa,Jakarta,Andi Susetyo,15,20,1000
1,Jawa,Bandung,Budi Budiawan,12,15,200
2,Jawa,Surabaya,Cecep Maricep,12,12,3000
3,Sumatera,Medan,Diana Wijaya,13,14,12000
4,Sumatera,Padang,Eddy Susanto,16,18,8000
5,Sumatera,Palembang,Franky Sujaya,18,14,5000
6,Sulawesi,Manado,Galih Diantara,20,25,7000
7,Sulawesi,Palu,Hans Leman,11,12,2500
8,Sulawesi,Makassar,Ingrid Mahesa,14,13,9000

In [104]:
df.head() # menampilkan (default) 5 data pertama dari dataframe

,Region,Kota,Mandor,Total Produksi,Jumlah Karyawan,penjualan
0,Jawa,Jakarta,Andi Susetyo,15,20,1000
1,Jawa,Bandung,Budi Budiawan,12,15,200
2,Jawa,Surabaya,Cecep Maricep,12,12,3000
3,Sumatera,Medan,Diana Wijaya,13,14,12000
4,Sumatera,Padang,Eddy Susanto,16,18,8000

In [105]:
df.tail() #menampilkan 5 data terakhir

,Region,Kota,Mandor,Total Produksi,Jumlah Karyawan,penjualan
4,Sumatera,Padang,Eddy Susanto,16,18,8000
5,Sumatera,Palembang,Franky Sujaya,18,14,5000
6,Sulawesi,Manado,Galih Diantara,20,25,7000
7,Sulawesi,Palu,Hans Leman,11,12,2500
8,Sulawesi,Makassar,Ingrid Mahesa,14,13,9000

In [106]:
df.info()
# informasi umum dari df
# column= nama kolom
#  non-null count= jumlah data yang tidak kosong
# Dtype =data tipe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Region           9 non-null      object
 1   Kota             9 non-null      object
 2   Mandor           9 non-null      object
 3   Total Produksi   9 non-null      int64
 4   Jumlah Karyawan  9 non-null      int64
 5   penjualan        9 non-null      int64
dtypes: int64(3), object(3)
memory usage: 560.0+ bytes

In [107]:
df.dtypes #data tipe dari tiap kolom

Region             object
Kota               object
Mandor             object
Total Produksi      int64
Jumlah Karyawan     int64
penjualan           int64
dtype: object

In [108]:
df.describe() # ringkasan statistik deskripsi dari data
# secara default menampilkan hanya agregasi data numerik

       Total Produksi  Jumlah Karyawan    penjualan
count        9.000000         9.000000      9.00000
mean        14.555556        15.888889   5300.00000
std          3.004626         4.342938   3976.17907
min         11.000000        12.000000    200.00000
25%         12.000000        13.000000   2500.00000
50%         14.000000        14.000000   5000.00000
75%         16.000000        18.000000   8000.00000
max         20.000000        25.000000  12000.00000

In [109]:
df.describe(include='all') # semua kolom

       Region   Kota      Mandor  Total Produksi  Jumlah Karyawan    penjualan
count       9      9           9        9.000000         9.000000      9.00000
unique      3      9           9             NaN              NaN          NaN
top      Jawa  Medan  Hans Leman             NaN              NaN          NaN
freq        3      1           1             NaN              NaN          NaN
mean      NaN    NaN         NaN       14.555556        15.888889   5300.00000
std       NaN    NaN         NaN        3.004626         4.342938   3976.17907
min       NaN    NaN         NaN       11.000000        12.000000    200.00000
25%       NaN    NaN         NaN       12.000000        13.000000   2500.00000
50%       NaN    NaN         NaN       14.000000        14.000000   5000.00000
75%       NaN    NaN         NaN       16.000000        18.000000   8000.00000
max       NaN    NaN         NaN       20.000000        25.000000  12000.00000

In [110]:
df.describe(include='object') # agregasi kolom berisi string

       Region   Kota      Mandor
count       9      9           9
unique      3      9           9
top      Jawa  Medan  Hans Leman
freq        3      1           1

In [111]:
df

,Region,Kota,Mandor,Total Produksi,Jumlah Karyawan,penjualan
0,Jawa,Jakarta,Andi Susetyo,15,20,1000
1,Jawa,Bandung,Budi Budiawan,12,15,200
2,Jawa,Surabaya,Cecep Maricep,12,12,3000
3,Sumatera,Medan,Diana Wijaya,13,14,12000
4,Sumatera,Padang,Eddy Susanto,16,18,8000
5,Sumatera,Palembang,Franky Sujaya,18,14,5000
6,Sulawesi,Manado,Galih Diantara,20,25,7000
7,Sulawesi,Palu,Hans Leman,11,12,2500
8,Sulawesi,Makassar,Ingrid Mahesa,14,13,9000

In [112]:
df.loc[9]=['Jawa','Jakarta',np.nan,np.nan,np.nan,np.nan]
df

,Region,Kota,Mandor,Total Produksi,Jumlah Karyawan,penjualan
0,Jawa,Jakarta,Andi Susetyo,15.0,20.0,1000.0
1,Jawa,Bandung,Budi Budiawan,12.0,15.0,200.0
2,Jawa,Surabaya,Cecep Maricep,12.0,12.0,3000.0
3,Sumatera,Medan,Diana Wijaya,13.0,14.0,12000.0
4,Sumatera,Padang,Eddy Susanto,16.0,18.0,8000.0
5,Sumatera,Palembang,Franky Sujaya,18.0,14.0,5000.0
6,Sulawesi,Manado,Galih Diantara,20.0,25.0,7000.0
7,Sulawesi,Palu,Hans Leman,11.0,12.0,2500.0
8,Sulawesi,Makassar,Ingrid Mahesa,14.0,13.0,9000.0
9,Jawa,Jakarta,NaN,NaN,NaN,NaN

In [113]:
df.describe(include='object') # top adalah data yg paling sering muncul
# freq adalah frequensi dari data yang paling sering muncul

       Region     Kota      Mandor
count      10       10           9
unique      3        9           9
top      Jawa  Jakarta  Hans Leman
freq        4        2           1

In [114]:
print('rata-rata: ',df['penjualan'].mean())
print('median: ',df['penjualan'].median())
print('standard deviasi: ',df['penjualan'].std())
print('nilai min: ',df['penjualan'].min())
print('nilai max: ',df['penjualan'].max())

rata-rata:  5300.0
median:  5000.0
standard deviasi:  3976.1790704142086
nilai min:  200.0
nilai max:  12000.0

In [115]:
df['Region'].unique() #menampilkan data apa saja yang pernah muncul di suatu kolom
# mirip distinct sql

array(['Jawa', 'Sumatera', 'Sulawesi'], dtype=object)

In [116]:
df['Region'].nunique() #menampilkan ADA BERAPA jumlah data unik di suatu kolom
# sql: count(distinct())

3

In [117]:
df['Region'].value_counts() # menampilkan jumlah kemunculan tiap2 data di suatu kolom
# di kolom region jawa muncul 4 kali, sumatera muncul 3 kali dan sulawesi muncul 3 kali

Jawa        4
Sumatera    3
Sulawesi    3
Name: Region, dtype: int64

In [118]:
df.shape # menampilkan bentuk dari data frame ( jumlah baris, jumlah kolom)

(10, 6)

In [119]:
df.isna() # Apakah suatu data di dataframe merupakan data kosong/ nan
# Nan= Not a Number, data kosong di df biasanya direpresentasikan dengan nilai ini

   Region   Kota  Mandor  Total Produksi  Jumlah Karyawan  penjualan
0   False  False   False           False            False      False
1   False  False   False           False            False      False
2   False  False   False           False            False      False
3   False  False   False           False            False      False
4   False  False   False           False            False      False
5   False  False   False           False            False      False
6   False  False   False           False            False      False
7   False  False   False           False            False      False
8   False  False   False           False            False      False
9   False  False    True            True             True       True

In [120]:
df.isna().sum() # menampilkan jumlah data kosong/nan di setiap kolom

Region             0
Kota               0
Mandor             1
Total Produksi     1
Jumlah Karyawan    1
penjualan          1
dtype: int64

In [121]:
df.dropna() #menghapus baris (secara default) yang memiliki data kosong/nan
# kalau mau permanen, jangan lupa disimpan

,Region,Kota,Mandor,Total Produksi,Jumlah Karyawan,penjualan
0,Jawa,Jakarta,Andi Susetyo,15.0,20.0,1000.0
1,Jawa,Bandung,Budi Budiawan,12.0,15.0,200.0
2,Jawa,Surabaya,Cecep Maricep,12.0,12.0,3000.0
3,Sumatera,Medan,Diana Wijaya,13.0,14.0,12000.0
4,Sumatera,Padang,Eddy Susanto,16.0,18.0,8000.0
5,Sumatera,Palembang,Franky Sujaya,18.0,14.0,5000.0
6,Sulawesi,Manado,Galih Diantara,20.0,25.0,7000.0
7,Sulawesi,Palu,Hans Leman,11.0,12.0,2500.0
8,Sulawesi,Makassar,Ingrid Mahesa,14.0,13.0,9000.0

In [122]:
df.dropna(axis=1) # menghapus kolom yang memiliki data kosong/nan

     Region       Kota
0      Jawa    Jakarta
1      Jawa    Bandung
2      Jawa   Surabaya
3  Sumatera      Medan
4  Sumatera     Padang
5  Sumatera  Palembang
6  Sulawesi     Manado
7  Sulawesi       Palu
8  Sulawesi   Makassar
9      Jawa    Jakarta

In [123]:
df.fillna('missing value') # mengisi data kosong/nan dengan nilai tertentu

,Region,Kota,Mandor,Total Produksi,Jumlah Karyawan,penjualan
0,Jawa,Jakarta,Andi Susetyo,15,20,1000
1,Jawa,Bandung,Budi Budiawan,12,15,200
2,Jawa,Surabaya,Cecep Maricep,12,12,3000
3,Sumatera,Medan,Diana Wijaya,13,14,12000
4,Sumatera,Padang,Eddy Susanto,16,18,8000
5,Sumatera,Palembang,Franky Sujaya,18,14,5000
6,Sulawesi,Manado,Galih Diantara,20,25,7000
7,Sulawesi,Palu,Hans Leman,11,12,2500
8,Sulawesi,Makassar,Ingrid Mahesa,14,13,9000
9,Jawa,Jakarta,missing value,missing value,missing value,missing value

In [124]:
df['Mandor'].fillna('missing value') # bisa dilakukan di kolom tertentu saja

0      Andi Susetyo
1     Budi Budiawan
2     Cecep Maricep
3      Diana Wijaya
4      Eddy Susanto
5     Franky Sujaya
6    Galih Diantara
7        Hans Leman
8     Ingrid Mahesa
9     missing value
Name: Mandor, dtype: object

In [126]:
df[['Total Produksi','penjualan']].fillna(-1)

   Total Produksi  penjualan
0            15.0     1000.0
1            12.0      200.0
2            12.0     3000.0
3            13.0    12000.0
4            16.0     8000.0
5            18.0     5000.0
6            20.0     7000.0
7            11.0     2500.0
8            14.0     9000.0
9            -1.0       -1.0

Aggregating

In [131]:
# groupby() untuk agregasi berdasarkan kelompok tertentu
df.groupby('Region').mean()['penjualan'] # rata-rata penjualan per region
# mirip group by di sql

Region
Jawa        1400.000000
Sulawesi    6166.666667
Sumatera    8333.333333
Name: penjualan, dtype: float64

In [132]:
df.groupby('Region').std() #standard deviasi

          Total Produksi  Jumlah Karyawan    penjualan
Region
Jawa            1.732051         4.041452  1442.220510
Sulawesi        4.582576         7.234178  3329.164059
Sumatera        2.516611         2.309401  3511.884584

In [133]:
df.groupby('Region', as_index=False).mean() # region tidak jadi index, tapi jadi kolom

     Region  Total Produksi  Jumlah Karyawan    penjualan
0      Jawa       13.000000        15.666667  1400.000000
1  Sulawesi       15.000000        16.666667  6166.666667
2  Sumatera       15.666667        15.333333  8333.333333

In [134]:
df

,Region,Kota,Mandor,Total Produksi,Jumlah Karyawan,penjualan
0,Jawa,Jakarta,Andi Susetyo,15.0,20.0,1000.0
1,Jawa,Bandung,Budi Budiawan,12.0,15.0,200.0
2,Jawa,Surabaya,Cecep Maricep,12.0,12.0,3000.0
3,Sumatera,Medan,Diana Wijaya,13.0,14.0,12000.0
4,Sumatera,Padang,Eddy Susanto,16.0,18.0,8000.0
5,Sumatera,Palembang,Franky Sujaya,18.0,14.0,5000.0
6,Sulawesi,Manado,Galih Diantara,20.0,25.0,7000.0
7,Sulawesi,Palu,Hans Leman,11.0,12.0,2500.0
8,Sulawesi,Makassar,Ingrid Mahesa,14.0,13.0,9000.0
9,Jawa,Jakarta,NaN,NaN,NaN,NaN

In [139]:
df['Mandor'].str.upper() # .str -> modul khusus untuk fungsi-fungsi string

0      ANDI SUSETYO
1     BUDI BUDIAWAN
2     CECEP MARICEP
3      DIANA WIJAYA
4      EDDY SUSANTO
5     FRANKY SUJAYA
6    GALIH DIANTARA
7        HANS LEMAN
8     INGRID MAHESA
9               NaN
Name: Mandor, dtype: object